vladkozlov69/Arduino_NRF52_AppTimer/app_timer.c
#define TIMER_NULL                  ((app_timer_id_t)(0 - 1))                   /**< Invalid timer id. */
#define CONTEXT_QUEUE_SIZE_MAX      (2)                                         /**< Timer internal elapsed ticks queue size. */

static uint8_t                       m_node_array_size;                         /**< Size of timer node array. */
static timer_node_t *                mp_nodes = NULL;                           /**< Array of timer nodes. */
static uint8_t                       m_user_array_size;                         /**< Size of timer user array. */
static timer_user_t *                mp_users;                                  /**< Array of timer users. */
static app_timer_id_t                m_timer_id_head;                           /**< First timer in list of running timers. */
static uint32_t                      m_ticks_latest;                            /**< Last known RTC counter value. */
static uint32_t                      m_ticks_elapsed[CONTEXT_QUEUE_SIZE_MAX];   /**< Timer internal elapsed ticks queue. */
static uint8_t                       m_ticks_elapsed_q_read_ind;                /**< Timer internal elapsed ticks queue read index. */
static uint8_t                       m_ticks_elapsed_q_write_ind;               /**< Timer internal elapsed ticks queue write index. */
static app_timer_evt_schedule_func_t m_evt_schedule_func;                       /**< Pointer to function for propagating timeout events to the scheduler. */
static bool                          m_rtc2_running;                            /**< Boolean indicating if RTC2 is running. */
static bool                          m_rtc2_reset;                              /**< Boolean indicating if RTC2 counter has been reset due to last timer removed from timer list during the timer list handling. */
 

/**@brief Function for initializing the RTC2 counter.
 *
 * @param[in] prescaler   Value of the RTC2 PRESCALER register. Set to 0 for no prescaling.
 */
void rtc2_init(uint32_t prescaler)
{
    NRF_RTC2->PRESCALER = prescaler;
    NVIC_SetPriority(RTC2_IRQn, RTC2_IRQ_PRI);
}


/**@brief Function for starting the RTC2 timer.
 */
void rtc2_start(void)
{
    NRF_RTC2->EVTENSET = RTC_EVTEN_COMPARE0_Msk;
    NRF_RTC2->INTENSET = RTC_INTENSET_COMPARE0_Msk;

    NVIC_ClearPendingIRQ(RTC2_IRQn);
    NVIC_EnableIRQ(RTC2_IRQn);

    NRF_RTC2->TASKS_START = 1;
    nrf_delay_us(MAX_RTC_TASKS_DELAY);

    m_rtc2_running = true;
}


/**@brief Function for stopping the RTC2 timer.
 */
void rtc2_stop(void)
{
    NVIC_DisableIRQ(RTC2_IRQn);

    NRF_RTC2->EVTENCLR = RTC_EVTEN_COMPARE0_Msk;
    NRF_RTC2->INTENCLR = RTC_INTENSET_COMPARE0_Msk;

    NRF_RTC2->TASKS_STOP = 1;

    nrf_delay_us(MAX_RTC_TASKS_DELAY);

    NRF_RTC2->TASKS_CLEAR = 1;
    m_ticks_latest        = 0;
    nrf_delay_us(MAX_RTC_TASKS_DELAY);

    m_rtc2_running = false;
}


/**@brief Function for returning the current value of the RTC2 counter.
 *
 * @return     Current value of the RTC2 counter.
 */
static __INLINE uint32_t rtc2_counter_get(void)
{
    return NRF_RTC2->COUNTER;
}


/**@brief Function for computing the difference between two RTC2 counter values.
 *
 * @return     Number of ticks elapsed from ticks_old to ticks_now.
 */
static __INLINE uint32_t ticks_diff_get(uint32_t ticks_now, uint32_t ticks_old)
{
    return ((ticks_now - ticks_old) & MAX_RTC_COUNTER_VAL);
}


/**@brief Function for setting the RTC2 Capture Compare register 0, and enabling the corresponding
 *        event.
 *
 * @param[in] value   New value of Capture Compare register 0.
 */
static __INLINE void rtc2_compare0_set(uint32_t value)
{
    NRF_RTC2->CC[0] = value;
}


/**@brief Function for inserting a timer in the timer list.
 *
 * @param[in]  timer_id   Id of timer to insert.
 */
static void timer_list_insert(app_timer_id_t timer_id)
{
    timer_node_t * p_timer = &mp_nodes[timer_id];
    
    if (m_timer_id_head == TIMER_NULL)
    {
        m_timer_id_head = timer_id;
    }
    else
    {
        if (p_timer->ticks_to_expire <= mp_nodes[m_timer_id_head].ticks_to_expire)
        {
            mp_nodes[m_timer_id_head].ticks_to_expire -= p_timer->ticks_to_expire;
            
            p_timer->next   = m_timer_id_head;
            m_timer_id_head = timer_id;
        }
        else
        {
            app_timer_id_t previous;
            app_timer_id_t current;
            uint32_t       ticks_to_expire;

            ticks_to_expire = p_timer->ticks_to_expire;
            previous        = m_timer_id_head;
            current         = m_timer_id_head;
            
            while ((current != TIMER_NULL) && (ticks_to_expire > mp_nodes[current].ticks_to_expire))
            {
                ticks_to_expire -= mp_nodes[current].ticks_to_expire;
                previous         = current;
                current          = mp_nodes[current].next;
            }

            if (current != TIMER_NULL)
            {
                mp_nodes[current].ticks_to_expire -= ticks_to_expire;
            }

            p_timer->ticks_to_expire = ticks_to_expire;
            p_timer->next            = current;
            mp_nodes[previous].next  = timer_id;
        }
    }
}


/**@brief Function for removing a timer from the timer queue.
 *
 * @param[in]  timer_id   Id of timer to remove.
 */
static void timer_list_remove(app_timer_id_t timer_id)
{
    app_timer_id_t previous;
    app_timer_id_t current;
    uint32_t       timeout;

    // Find the timer's position in timer list.
    previous = m_timer_id_head;
    current  = previous;
    
    while (current != TIMER_NULL)
    {
        if (current == timer_id)
        {
            break;
        }
        previous = current;
        current  = mp_nodes[current].next;
    }

    // Timer not in active list.
    if (current == TIMER_NULL)
    {
        return;
    }

    // Timer is the first in the list
    if (previous == current)
    {
        m_timer_id_head = mp_nodes[m_timer_id_head].next;

        // No more timers in the list. Reset RTC2 in case Start timer operations are present in the queue.
        if (m_timer_id_head == TIMER_NULL)
        {
            NRF_RTC2->TASKS_CLEAR = 1;
            m_ticks_latest        = 0;
            m_rtc2_reset          = true;
        }
    }

    // Remaining timeout between next timeout.
    timeout = mp_nodes[current].ticks_to_expire;

    // Link previous timer with next of this timer, i.e. removing the timer from list.
    mp_nodes[previous].next = mp_nodes[current].next;

    // If this is not the last timer, increment the next timer by this timer timeout.
    current = mp_nodes[previous].next;
    if (current != TIMER_NULL)
    {
        mp_nodes[current].ticks_to_expire += timeout;
    }
}


/**@brief Function for scheduling a check for timeouts by generating a RTC2 interrupt.
 */
static void timer_timeouts_check_sched(void)
{
    NVIC_SetPendingIRQ(RTC2_IRQn);
}


/**@brief Function for scheduling a timer list update by generating a SWI0 interrupt.
 */
static void timer_list_handler_sched(void)
{
    NVIC_SetPendingIRQ(SWI_IRQn);
}


/**@brief Function for executing an application timeout handler, either by calling it directly, or
 *        by passing an event to the @ref app_scheduler.
 *
 * @param[in]  p_timer   Pointer to expired timer.
 */
static void timeout_handler_exec(timer_node_t * p_timer)
{
    if (m_evt_schedule_func != NULL)
    {
        uint32_t err_code = m_evt_schedule_func(p_timer->p_timeout_handler, p_timer->p_context);
        // APP_ERROR_CHECK(err_code);
    }
    else
    {
        p_timer->p_timeout_handler(p_timer->p_context);
    }
}


/**@brief Function for checking for expired timers.
 */
void timer_timeouts_check(void)
{
    // Handle expired of timer 
    if (m_timer_id_head != TIMER_NULL)
    {
        app_timer_id_t  timer_id;
        uint32_t        ticks_elapsed;
        uint32_t        ticks_expired;

